/* SAMKeychainQuery */
"SAMKeychainErrorBadArguments" = "Some arguments provided are invalid.";
"errSecUnimplemented" = "The requested function or operation is not implemented.";
"errSecParam" = "Invalid parameters were passed to the function.";
"errSecAllocate" = "Memory allocation failed.";
"errSecNotAvailable" = "No keychain is available. Try restarting your device.";
"errSecDuplicateItem" = "The item already exists in the keychain.";
"errSecItemNotFound" = "The specified item is not in the keychain.";
"errSecInteractionNotAllowed" = "Interaction with the keychain is not allowed.";
"errSecDecode" = "The provided data could not be decoded.";
"errSecAuthFailed" = "Incorrect username or password entered.";
"errSecDefault" = "Refer to SecBase.h for further details.";
